app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "username") VALUES ($1, $2, $3) RETURNING "id"  [["email", "erin@erin.com"], ["password_digest", "$2a$10$72DWdPQMus.uhVifFJpIg.SRmh484K3P4yb9FnMMd59N8IbAVNnP2"], ["username", "erinisgreat"]]
---
  def create
    # If I remove the 'password == password_confirmation' line, it allows users to sign up with invalid info/unmatched passwords!
    if params[:password] == params[:password_confirmation]
      user = User.new params[:user]
      user.password = params[:password]
      if user.save